In [1]:
import pandas as pd

# Create two sample DataFrames
data1 = {'ID': [1, 2, 3, 4],
         'Name': ['Imen', 'Karthika', 'Cosimo', 'Cathrine'],
         'Department': ['HR', 'IT', 'Finance', 'IT']}

data2 = {'ID': [1, 2, 3, 5],
         'Salary': [50000, 60000, 45000, 70000],
         'Department': ['HR', 'IT', 'Finance', 'Marketing']}

In [4]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [6]:
df1

   ID      Name Department
0   1      Imen         HR
1   2  Karthika         IT
2   3    Cosimo    Finance
3   4  Cathrine         IT

In [7]:
df2

   ID  Salary Department
0   1   50000         HR
1   2   60000         IT
2   3   45000    Finance
3   5   70000  Marketing

In [3]:
merged_df = pd.merge(df1,df2,on=['ID','Department'])
merged_df

   ID      Name Department  Salary
0   1      Imen         HR   50000
1   2  Karthika         IT   60000
2   3    Cosimo    Finance   45000